Revit 2027 API
ThermalAsset.Density Property
 The density of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Density { get; set; }
Public Property Density As Double
	Get
	Set
public:
property double Density {
	double get ();
	void set (double value);
}
member Density : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for density must be non-negative.
Remarks
 Values are in kilograms per cubed feet (kg/ft³) and must be non-negative.
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace